In [100]:
import psycopg2
import pandas as pd

# Define connection parameters
server = 'localhost'  # Your PostgreSQL server address (or IP)
database = 'postgres'  # Your PostgreSQL database name
username = 'postgres'  # Your PostgreSQL username
password = 'postgres'  # Your PostgreSQL password
port = '5432'  # Default PostgreSQL port

# Create a connection to the PostgreSQL database
try:
    connection = psycopg2.connect(
        host=server,
        database=database,
        user=username,
        password=password,
        port=port
    )

    # Create a cursor object
    cursor = connection.cursor()

    # Define your query
    query = "SELECT * from rides"

    # Use Pandas to execute the query and load data into a DataFrame
    df = pd.read_sql(query, connection)
    # Print the DataFrame
    print("Query executed successfully.")

    # Close cursor and connection
    cursor.close()
    connection.close()

except Exception as e:
    print(f"Connection failed: {e}")

C:\Users\subas\AppData\Local\Temp\ipykernel_26904\410171944.py:28: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, connection)

Query executed successfully.

#### 1.what are the mode of rides available on rapido

In [71]:
display(df['services'].drop_duplicates().sort_values())

1            auto
14           bike
9       bike lite
0     cab economy
7          parcel
Name: services, dtype: object

#### 2.how many completed and cancelled numeric & %

In [77]:
df.groupby('ride_status').agg({'ride_status':'count'})

             ride_status
ride_status
cancelled           5036
completed          44964

#### 3.most common source and distination

In [87]:
df.groupby('source')\
    .agg({'source':'count'})\
        .rename(columns={'source': 'Count'})\
            .sort_values(by='Count',ascending=False)\
                .head(5)

                          Count
source
Kothanur Landing             23
Vijayanagar Square           20
Banaswadi Landing            20
HRBR Layout Landing          19
Ramamurthy Nagar Landing     18

In [88]:
df.groupby('destination')\
    .agg({'destination':'count'})\
        .rename(columns={'destination': 'Count'})\
            .sort_values(by='Count',ascending=False)\
                .head(5)

                   Count
destination
Gottigere Landing     23
Gottigere Square      20
Kudlu Square          17
HRBR Layout Drive     17
Hulimavu Drive        16

#### 4.average ride charge per km

In [91]:
display(df['ride_charge'].mean()/df['distance'].mean())

np.float64(20.464737848534565)

#### 5.average misc charge per km

In [92]:
display(df['misc_charge'].mean()/df['distance'].mean())

np.float64(0.9779085989726339)

#### 6.mode of payment

In [93]:
df['payment_method'].drop_duplicates().sort_values()

0    Amazon Pay
6          GPay
1         Paytm
3       QR scan
2           nan
Name: payment_method, dtype: object

#### 7.total amount and service

In [97]:
df.groupby('services').agg({'total_fare':'sum'}).sort_values(by='total_fare',ascending=False)

             total_fare
services
bike         7432783.95
auto         6099731.32
cab economy  5006233.04
parcel       3686514.15
bike lite    2387720.59

#### 8.average cancelled km

In [101]:
df.agg({'distance':['average','min','max']})

          distance
average  25.528243
min       1.000000
max      50.000000